tap "1xyz/pryrite"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "minio/stable"
tap "reviewdog/tap"
brew "act"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "unixodbc"
brew "asdf"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "bazel"
brew "checkstyle"
brew "clang-format"
brew "cmake"
brew "cpanminus"
brew "cppcheck"
brew "curl"
brew "diffr"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "doxygen"
brew "ed"
brew "eigen"
brew "fd"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "glpk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gradle"
brew "grep"
brew "gsl"
brew "libaec"
brew "hdf5"
brew "ncurses"
brew "htop"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "include-what-you-use"
brew "llvm"
brew "make"
brew "mas"
brew "ncdu"
brew "neovim"
brew "openblas"
brew "perl"
brew "php"
brew "prettier"
brew "psqlodbc"
brew "qt"
brew "pyqt"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "rsync"
brew "ruby"
brew "rust"
brew "stow"
brew "suite-sparse"
brew "swig"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "uncrustify"
brew "vale"
brew "wget"
brew "wp-cli"
brew "yadm"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "1xyz/pryrite/pryrite"
brew "minio/stable/mc"
brew "reviewdog/tap/reviewdog"
cask "alfred"
cask "citrix-workspace"
cask "discord"
cask "dozer"
cask "dropbox"
cask "element"
cask "fiji"
cask "garmin-express"
cask "google-drive"
cask "harvest"
cask "inkscape"
cask "mactex-no-gui"
cask "mendeley"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "oclint"
cask "orbstack"
cask "rectangle"
cask "runescape"
cask "scroll-reverser"
cask "signal"
cask "skim"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "Be Focused", id: 973134470
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SonicWall Mobile Connect", id: 822514576
vscode "aaron-bond.better-comments"
vscode "adamvoss.vscode-languagetool"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.Bookmarks"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "dakara.transformer"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbankier.vscode-quick-select"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "Gimly81.matlab"
vscode "github.vscode-github-actions"
vscode "GrapeCity.gc-excelviewer"
vscode "James-Yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.vscode-peacock"
vscode "JPTarquino.postgresql"
vscode "lextudio.restructuredtext"
vscode "lextudio.restructuredtext-pack"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "ptweir.python-string-sql"
vscode "quarto.quarto"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "salbert.copy-text"
vscode "scala-lang.scala"
vscode "shengchen.vscode-checkstyle"
vscode "sourcery.sourcery"
vscode "streetsidesoftware.hunspell"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "techer.open-in-browser"
vscode "tecosaur.latex-utilities"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"
