# must be loaded first
getantidote/use-omz

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git

# completions
zsh-users/zsh-completions kind:fpath path:src
belak/zsh-utils path:completion

# core plugins
Aloxaf/fzf-tab
joshskidmore/zsh-fzf-history-search
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
