getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git

zsh-users/zsh-completions kind:fpath path:src
belak/zsh-utils path:completion
belak/zsh-utils path:history
belak/zsh-utils path:utility

# defer these plugins
Aloxaf/fzf-tab kind:defer
joshskidmore/zsh-fzf-history-search kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
