getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git

zsh-users/zsh-completions kind:fpath path:src
belak/zsh-utils path:completion
belak/zsh-utils path:history
belak/zsh-utils path:utility

Aloxaf/fzf-tab
joshskidmore/zsh-fzf-history-search
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
