# must be loaded first
getantidote/use-omz

# load all OMZ lib (might not be needed)
ohmyzsh/ohmyzsh path:lib

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git

# core plugins
Aloxaf/fzf-tab
joshskidmore/zsh-fzf-history-search
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions path:src kind:fpath
zsh-users/zsh-history-substring-search
